//------------------------------------------------------------------------------------
//
//  系统名称        : 医生工作站
//  子系统名称      : 通用模块
//  对象类型        : 
//  类名            : UniversalVarApp.cs
//  功能概要        : 应用程序配置
//  作成者          : 付军
//  作成日          : 2007-01-19
//  版本            : 1.0.0.0
// 
//------------------< 变更历史 >------------------------------------------------------
//  变更日期        :
//  变更者          :
//  变更内容        :
//  版本            :
//------------------------------------------------------------------------------------
using System;
using System.Data;

namespace HISPlus
{
	/// <summary>
	/// UniversalVarApp 的摘要说明。
	/// </summary>
	public class MsgDbI
	{
        public MsgDbI()
		{
		}
        
        
        /// <summary>
        /// 加载默认消息
        /// </summary>
        public void LoadMsg(ref Message msg)
        {
            msg.AddMsg("E00001","{0}超过最大长度{1}!");
            msg.AddMsg("E00002","保存失败!");
            msg.AddMsg("E00003","错误的用户名或密码!");
            msg.AddMsg("E00004","必须输入{0}!");
            msg.AddMsg("E00005","删除{0}失败!");
            msg.AddMsg("E00006","{0}已经存在, 请输入不同的{1}!");
            msg.AddMsg("E00007","{0}必须是{1}!");
            msg.AddMsg("E00008","两次输入的密码不同! 请重新输入。");
            msg.AddMsg("E00009","密码错误!");
            msg.AddMsg("E00010","密码修改失败!");
            msg.AddMsg("E00011","请先确定病人!");
            msg.AddMsg("E00012","请输入正数!");
            msg.AddMsg("E00013","护理日期必须为当天才能保存!");
            msg.AddMsg("E00014","请先确定病人!");
            msg.AddMsg("E00015","时间格式不正确, 应该如HH:mm:ss形式。");
            msg.AddMsg("E00016","{0}不正确, 有效范围为 {1} - {2}");
            msg.AddMsg("E00017","只能执行当天的执行单!");
            msg.AddMsg("E00018","您的系统没有安装手写输入识别器。您至少需要在你的系统上安装一个手写输入识别器!");
            msg.AddMsg("E00019","只能逐条对医嘱进行手工调整!");
            msg.AddMsg("E00020","只有录入者或超级用户才能修改上次记录的结果!");
            msg.AddMsg("E00021","请先选择要拆分的医嘱!");
            msg.AddMsg("E00022","请先确定要删除的医嘱执行单!");
            msg.AddMsg("E00023","只能删除已经停止了医嘱的医嘱执行单!");
            msg.AddMsg("E00024","该医嘱执行单已经执行过了, 不能删除已执行过的医嘱执行单!");
            msg.AddMsg("E00025","打印模板定义错误!");
            msg.AddMsg("E00026","该病人没有医嘱执行单!");
            msg.AddMsg("E00027","请先选择病历!");
            msg.AddMsg("E00028","提取服务器上的文件出错。错误码:{0}。");
            msg.AddMsg("E00029","病历文件服务器配置信息不全!");
            msg.AddMsg("E00030","病历文件被非法改动!");
            msg.AddMsg("E00031","日期时间格式不正确, 应该如2000-10-08 12:30:00形式。");
            msg.AddMsg("E00032","没有取到病人所在科室!");
            msg.AddMsg("E00033","当前医嘱已经校对，请用[新增]。");
            msg.AddMsg("E00034","请先确定插入位置!");
            msg.AddMsg("E00035","医嘱已经校对, 不能删除当前医嘱!");
            msg.AddMsg("E00036","此医嘱有子医嘱，请先删除子医嘱后再删除此医嘱!");
            msg.AddMsg("E00037","医嘱记录为空,删除无效!");
            msg.AddMsg("E00038","检验单已执行,不能删除!");
            msg.AddMsg("E00039","检验单已计价,不能删除!");
            msg.AddMsg("E00040","子医嘱不能是第一条医嘱!");
            msg.AddMsg("E00041","长期医嘱 停止时间非空不能设子医嘱!");
            msg.AddMsg("E00042","不是药疗医嘱不能构成复合医嘱!");
            msg.AddMsg("E00043","途径不同的医嘱不能构成复合医嘱!");
            msg.AddMsg("E00044","只有长期医嘱才能停止!");
            msg.AddMsg("E00045","只有已执行的医嘱才用停止!");
            msg.AddMsg("E00046","选择的检验项目中标本不一致,请重新选择!");
            msg.AddMsg("E00047","请先选择需删除的项目");
            msg.AddMsg("E00048","时间格式不正确,请重新输入!");
            msg.AddMsg("E00049","请输入检验科室!");
            msg.AddMsg("E00050","请输入标本!");
            msg.AddMsg("E00051","选择的标本与项目标本不一致!");
            msg.AddMsg("E00052","请输入检验项目!");
            msg.AddMsg("E00053","第{0}项目与前面项目的类别不一致!");
            msg.AddMsg("E00054","请选择医嘱!");
            msg.AddMsg("E00055","{0}失败!");
            msg.AddMsg("E00056", "该用户属于另外的病区, 不能切换成该用户!");
            msg.AddMsg("E00057", "请输入{0}!");
            msg.AddMsg("E00058", "密码必须以字母开头!");
            msg.AddMsg("E00059", "配置文件有误!");
            msg.AddMsg("E00060", "请选择{0}!");
            msg.AddMsg("E00061", "该项目没有设置内容!请与系统管理员联系!");
            msg.AddMsg("E00062", "二维码格式不正确!");
            msg.AddMsg("E00063", "瓶签日期不对!");


            msg.AddMsg("I00001","密码修改成功!");
            msg.AddMsg("I00002","初始化密码成功!");
            msg.AddMsg("I00003","请检验设备的时间设置, 系统将采用设备时间作为盘点时间!");
            msg.AddMsg("I00004","{0}成功!");
            msg.AddMsg("I00005","病人匹配正确!");
            msg.AddMsg("I00006","正确的病人!");
            //msg.AddMsg("I00007","不属于当前的病人!");
            msg.AddMsg("I00007","药品与病人不符!");
            msg.AddMsg("I00008", "请选择一个{0}!");
            msg.AddMsg("I00009", "护理事件时间不能大于当前时间!");
            msg.AddMsg("I00010", "该时间点已有数据, 不能修改时间!");
            msg.AddMsg("I00011", "记录时间不能大于当前时间!");
            msg.AddMsg("I00012", "病人与执行单匹配!");
            
            msg.AddMsg("Q00001","输入的内容没有保存, 需要保存吗?");
            msg.AddMsg("Q00002","您确认要删除 {0} {1} 吗?");
            msg.AddMsg("Q00003","您确认要退出本系统吗? ");
            msg.AddMsg("Q00004","您确认{0}吗?");
            msg.AddMsg("Q00005","您确认要重置用户: {0} 的密码吗?");
            msg.AddMsg("Q00006","数据已更改,需要保存吗?");
            msg.AddMsg("Q00007","输入的内容没有保存, 要放弃吗?");
            msg.AddMsg("Q00008","正在把临时存的数据保存到Db中, 确实要退出吗?");
            msg.AddMsg("Q00009","上次保存的数据没有完全上传到数据库中, 是否显示未保存的内容!");
            msg.AddMsg("Q00010","您确认已经手工同步完成所有上次没有保存成功的数据了吗?");
            msg.AddMsg("Q00011","数据没有同步完成, 现在手工同步吗?");
            msg.AddMsg("Q00012","数据没有同步成功, 现在手工同步吗?");
            msg.AddMsg("Q00013","您确认要删除选择的医嘱执行单吗?");
            msg.AddMsg("Q00014","同时删除相应的检验申请单吗?");
            msg.AddMsg("Q00015","您确认要取消已选择的检查项目吗?");
            msg.AddMsg("Q00016","是否保存已选定的检查项目?");
            msg.AddMsg("Q00017","更改科室将清除所有已录入检验项目，是否更改?");
            msg.AddMsg("Q00018","更改项目分类将清除所有已录入检验项目，是否更改?");
            msg.AddMsg("Q00019","您确认要删除当前项吗?");
            msg.AddMsg("Q00020","病人输液信息未保存, 要放弃吗?");
            msg.AddMsg("Q00021","执行单与病人匹配, 您确认{0}吗?");
            msg.AddMsg("Q00022","当前评估单未保存, 您确认{0}吗?");
            
            msg.AddMsg("S00000","");
            msg.AddMsg("S00001","欢迎使用本系统!");
            msg.AddMsg("S00002","数据缓存完毕!");
            msg.AddMsg("T00001","项目\\{0}H");
            msg.AddMsg("T10001","病人列表 (共{0}人)");
            msg.AddMsg("W00001","取检验申请单号错误!删除检验申请单失败!");
            msg.AddMsg("W00002","不能将有子医嘱的医嘱设为子医嘱。");
            msg.AddMsg("W00003","停止时间不能早于当前时间!");
            msg.AddMsg("W00004","草药请走处方！");
            msg.AddMsg("W00005","该病人不存在!");
            msg.AddMsg("W00006","选择的日期不能大于今天!");
            msg.AddMsg("W00007","请选择{0}!");            
        }
        
        
        /// <summary>
        /// 加载保存在数据库中的消息
        /// </summary>
        public void LoadMsg_Db(ref Message msg)
        {

        }
	}
}
